run/simpleBattery/data/BextSidewalls1.0/0/Voltage
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Voltage;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    sideWalls
    {
//	type		zeroGradient;
	type		fixedValue;
	value		uniform 0;
    }
    bottomWall
    {
	type		zeroGradient;
	//type	ixedValue;
	//value		uniform 0;
    }
    lithiumInterface
    {
        type            fixedValue;
        value           uniform -0.3; // Fedor - potential difference across bismuth
    }
    topSurface
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
